; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v2 ?v9)
             (pred_5 ?v12 ?v1)
             (pred_3 ?v2 ?v1)
             (pred_2 ?v5 ?v2 )
	     (pred_6 ?v2)
             (pred_4 ?v4)
             (pred_7 ?v12)
             (pred_11 ?v1)
             (pred_8 ?v2)
             (pred_10 ?v12)
             (pred_12 ?v2)
             (pred_9 ))



(:action op_3
:parameters (?v3 ?v11 ?v8 ?v6)
:precondition (and (pred_4 ?v3) (pred_4 ?v11) (pred_7 ?v8) (pred_11 ?v6)
          (pred_1 ?v3 ?v11) (pred_5 ?v8 ?v6)
                   (pred_3 ?v11 ?v6) (pred_6 ?v3) 
                   (pred_8 ?v11) (pred_10 ?v8))
:effect (and  (pred_12 ?v11) (not (pred_8 ?v11))))


(:action op_5
:parameters (?v3 ?v10)
:precondition (and (pred_4 ?v3) (pred_4 ?v10)
               (pred_6 ?v3) (pred_1 ?v3 ?v10) (pred_12 ?v10))
:effect (and (pred_6 ?v10) (not (pred_6 ?v3))))

(:action op_1
:parameters (?v3 ?v8)
:precondition (and (pred_4 ?v3) (pred_7 ?v8) 
                  (pred_6 ?v3) (pred_2 ?v8 ?v3) (pred_9 ))
:effect (and (pred_10 ?v8)
   (not (pred_2 ?v8 ?v3)) (not (pred_9 ))))


(:action op_4
:parameters (?v3 ?v13 ?v7)
:precondition (and (pred_4 ?v3) (pred_7 ?v13) (pred_7 ?v7)
                  (pred_6 ?v3) (pred_10 ?v7) (pred_2 ?v13 ?v3))
:effect (and (pred_10 ?v13) (pred_2 ?v7 ?v3)
        (not (pred_10 ?v7)) (not (pred_2 ?v13 ?v3))))

(:action op_2
:parameters (?v3 ?v8)
:precondition (and (pred_4 ?v3) (pred_7 ?v8) 
                  (pred_6 ?v3) (pred_10 ?v8))
:effect (and (pred_9 ) (pred_2 ?v8 ?v3) (not (pred_10 ?v8)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_18 obj_19 obj_15 obj_08 obj_06 obj_02 obj_11 obj_14 obj_12 obj_20 obj_03 obj_07 obj_09 obj_13 obj_17
    obj_05 obj_04
    obj_16 obj_21 obj_10
    )

    (:init
       (pred_9)

       (pred_4 obj_01)
       (pred_4 obj_18)
       (pred_4 obj_19)
       (pred_4 obj_15)
       (pred_4 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_02)
       (pred_4 obj_11)
       (pred_4 obj_14)
       (pred_4 obj_12)
       (pred_4 obj_20)
       (pred_4 obj_03)
       (pred_4 obj_07)
       (pred_4 obj_09)
       (pred_4 obj_13)
       (pred_4 obj_17)
       (pred_11 obj_05)
       (pred_11 obj_04)
       (pred_7 obj_16)
       (pred_7 obj_21)
       (pred_7 obj_10)

       (pred_1 obj_01 obj_08)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_18 obj_06)
       (pred_1 obj_18 obj_19)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_19 obj_02)
       (pred_1 obj_19 obj_15)
       (pred_1 obj_19 obj_18)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_15 obj_19)
       (pred_1 obj_08 obj_14)
       (pred_1 obj_08 obj_06)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_06 obj_02)
       (pred_1 obj_06 obj_18)
       (pred_1 obj_06 obj_08)
       (pred_1 obj_02 obj_20)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_02 obj_19)
       (pred_1 obj_02 obj_06)
       (pred_1 obj_11 obj_03)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_11 obj_02)
       (pred_1 obj_14 obj_07)
       (pred_1 obj_14 obj_12)
       (pred_1 obj_14 obj_08)
       (pred_1 obj_12 obj_09)
       (pred_1 obj_12 obj_20)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_12 obj_14)
       (pred_1 obj_20 obj_13)
       (pred_1 obj_20 obj_03)
       (pred_1 obj_20 obj_02)
       (pred_1 obj_20 obj_12)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_03 obj_11)
       (pred_1 obj_03 obj_20)
       (pred_1 obj_07 obj_09)
       (pred_1 obj_07 obj_14)
       (pred_1 obj_09 obj_13)
       (pred_1 obj_09 obj_12)
       (pred_1 obj_09 obj_07)
       (pred_1 obj_13 obj_17)
       (pred_1 obj_13 obj_20)
       (pred_1 obj_13 obj_09)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_17 obj_13)
       (pred_8 obj_09)
       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_3  obj_09 obj_05)
       (pred_3  obj_06 obj_04)
       (pred_3  obj_13 obj_04)
       (pred_12 obj_01)
       (pred_12 obj_18)
       (pred_12 obj_19)
       (pred_12 obj_15)
       (pred_12 obj_08)
       (pred_12 obj_02)
       (pred_12 obj_11)
       (pred_12 obj_14)
       (pred_12 obj_12)
       (pred_12 obj_20)
       (pred_12 obj_03)
       (pred_12 obj_07)
       (pred_12 obj_17)

       (pred_5  obj_16 obj_05)
       (pred_5  obj_21 obj_04)
       (pred_5  obj_10 obj_05)
       (pred_2 obj_16 obj_18)
       (pred_2 obj_21 obj_17)
       (pred_2 obj_10 obj_15)
       (pred_6 obj_18)
    )

    (:goal (and
       (pred_2 obj_16 obj_08)
       (pred_2 obj_10 obj_01)
    ))
(:constraints
  (always (not (pred_6 obj_19)))
)
)

; plan
1. (op_1 obj_18 obj_16)
   deleted: (pred_2 obj_16 obj_18) (pred_9)
   added: (pred_10 obj_16)
   goals met: 0 of 2
2. (op_5 obj_18 obj_01)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_01)
   goals met: 0 of 2
3. (op_5 obj_01 obj_08)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_08)
   goals met: 0 of 2
4. (op_2 obj_08 obj_16)
   deleted: (pred_10 obj_16)
   added: (pred_9) (pred_2 obj_16 obj_08)
   goals met: 1 of 2
5. (op_5 obj_08 obj_14)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_14)
   goals met: 1 of 2
6. (op_5 obj_14 obj_12)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_12)
   goals met: 1 of 2
7. (op_5 obj_12 obj_20)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_20)
   goals met: 1 of 2
8. (op_5 obj_20 obj_02)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_02)
   goals met: 1 of 2
9. (op_5 obj_02 obj_11)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_11)
   goals met: 1 of 2
10. (op_5 obj_11 obj_15)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_15)
   goals met: 1 of 2
11. (op_1 obj_15 obj_10)
   deleted: (pred_2 obj_10 obj_15) (pred_9)
   added: (pred_10 obj_10)
   goals met: 1 of 2
12. (op_5 obj_15 obj_11)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_11)
   goals met: 1 of 2
13. (op_5 obj_11 obj_02)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_02)
   goals met: 1 of 2
14. (op_5 obj_02 obj_20)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_20)
   goals met: 1 of 2
15. (op_5 obj_20 obj_12)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_12)
   goals met: 1 of 2
16. (op_5 obj_12 obj_14)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_14)
   goals met: 1 of 2
17. (op_5 obj_14 obj_08)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_08)
   goals met: 1 of 2
18. (op_5 obj_08 obj_01)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_01)
   goals met: 1 of 2
19. (op_2 obj_01 obj_10)
   deleted: (pred_10 obj_10)
   added: (pred_9) (pred_2 obj_10 obj_01)
   goals met: 2 of 2
